imjustadog/string-jn5168-stm32f103/Project/STM32F10x_StdPeriph_Template/main.c
	  TIM_DeInit(TIM3);
    TIM_InternalClockConfig(TIM3);                                
	  TIM_TimeBaseInit(TIM3, &timInitStruct);
	
		TIM_DeInit(TIM4);
    TIM_InternalClockConfig(TIM4);                                
	  TIM_TimeBaseInit(TIM4, &timInitStruct);
		
		timInitStruct.TIM_ClockDivision = TIM_CKD_DIV1;                
    timInitStruct.TIM_Prescaler = 23999;                    
    timInitStruct.TIM_CounterMode = TIM_CounterMode_Up;     
    timInitStruct.TIM_RepetitionCounter = 0;  
    timInitStruct.TIM_Period = 999; 
		
		TIM_DeInit(TIM6);
    TIM_InternalClockConfig(TIM6);                                
	  TIM_TimeBaseInit(TIM6, &timInitStruct);
		TIM_ITConfig(TIM6,TIM_IT_Update,ENABLE);
    
    tim_icinit.TIM_ICFilter = 0x0;
    tim_icinit.TIM_ICPolarity = TIM_ICPolarity_Falling;
    tim_icinit.TIM_ICPrescaler= TIM_ICPSC_DIV1;
    tim_icinit.TIM_ICSelection = TIM_ICSelection_DirectTI;
    
		tim_icinit.TIM_Channel = TIM_Channel_3;
	  TIM_ICInit(TIM2,&tim_icinit); 
		
		tim_icinit.TIM_Channel = TIM_Channel_4;
	  TIM_ICInit(TIM2,&tim_icinit); 
    
		tim_icinit.TIM_Channel = TIM_Channel_3;
	  TIM_ICInit(TIM3,&tim_icinit); 
		
		tim_icinit.TIM_Channel = TIM_Channel_4;
	  TIM_ICInit(TIM3,&tim_icinit); 
		
		tim_icinit.TIM_Channel = TIM_Channel_3;
	  TIM_ICInit(TIM4,&tim_icinit); 
		
		tim_icinit.TIM_Channel = TIM_Channel_1;
	  TIM_ICInit(TIM3,&tim_icinit); 
		
		TIM_ARRPreloadConfig(TIM2, DISABLE);  
    TIM_SelectInputTrigger(TIM2, TIM_TS_TI2FP2);
    TIM_SelectSlaveMode(TIM2, TIM_SlaveMode_Reset);
    TIM_SelectMasterSlaveMode(TIM2, TIM_MasterSlaveMode_Enable);
		
		TIM_ARRPreloadConfig(TIM3, DISABLE);  
    TIM_SelectInputTrigger(TIM3, TIM_TS_TI2FP2);
    TIM_SelectSlaveMode(TIM3, TIM_SlaveMode_Reset);
    TIM_SelectMasterSlaveMode(TIM3, TIM_MasterSlaveMode_Enable);
    
		TIM_ARRPreloadConfig(TIM4, DISABLE);  
    TIM_SelectInputTrigger(TIM4, TIM_TS_TI2FP2);
    TIM_SelectSlaveMode(TIM4, TIM_SlaveMode_Reset);
    TIM_SelectMasterSlaveMode(TIM4, TIM_MasterSlaveMode_Enable);
		
		TIM_DMAConfig(TIM2,TIM_DMABase_CCR3,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM2, TIM_DMA_CC3, ENABLE);
		
		TIM_DMAConfig(TIM2,TIM_DMABase_CCR4,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM2, TIM_DMA_CC4, ENABLE);
		
		TIM_DMAConfig(TIM3,TIM_DMABase_CCR3,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM3, TIM_DMA_CC3, ENABLE);
		
		TIM_DMAConfig(TIM3,TIM_DMABase_CCR4,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM3, TIM_DMA_CC4, ENABLE);
		
		TIM_DMAConfig(TIM4,TIM_DMABase_CCR3,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM4, TIM_DMA_CC3, ENABLE);
		
		TIM_DMAConfig(TIM3,TIM_DMABase_CCR1,TIM_DMABurstLength_1Byte);
    TIM_DMACmd(TIM3, TIM_DMA_CC1, ENABLE);
		
		TIM_Cmd(TIM2, DISABLE); 
		TIM_Cmd(TIM3, DISABLE); 
		TIM_Cmd(TIM4, DISABLE); 
		TIM_Cmd(TIM6, ENABLE);
}
/**
  * @brief  Configure the GPIOD Pins.
  * @param  None
  * @retval None
  */
void GPIO_Configuration(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
	
	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);      /*??SWD ??JTAG*/

  /* DMA */
  GPIO_InitStructure.GPIO_Pin =  STRING_PIN_PHZ1|STRING_PIN_PHZ2|STRING_PIN_PHZ6;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
	
  GPIO_InitStructure.GPIO_Pin =  STRING_PIN_PHZ3|STRING_PIN_PHZ4|STRING_PIN_PHZ5;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIOB, &GPIO_InitStructure);

  /* output */
  GPIO_InitStructure.GPIO_Pin = \
				ZIGBEE_PIN_RESET|STRING_PIN_CEC|STRING_PIN_CED|STRING_PIN_CEE|STRING_PIN_CEF|STRING_PIN_SWITCH|BAT_PIN_3;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = BAT_PIN_1;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = STRING_PIN_CEA|STRING_PIN_CEB|BAT_PIN_2;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = RS485_DE;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(GPIOD, &GPIO_InitStructure);
	
	/* Configure PB12-15 of spi mode */
	GPIO_InitStructure.GPIO_Pin =  SPIx_PIN_SCK | SPIx_PIN_MOSI;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
  GPIO_Init(SPIx_GPIO, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin =  SPIx_PIN_NSS;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_Init(SPIx_GPIO, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = SPIx_PIN_MISO;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(SPIx_GPIO, &GPIO_InitStructure);
	
	/* Configure PC0-3 as analog input -------------------------*/
  GPIO_InitStructure.GPIO_Pin = STRING_PIN_TEMPOP1 | STRING_PIN_TEMPOP2 | STRING_PIN_TEMPOP3 | STRING_PIN_TEMPOP4;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	/* Configure PA0-1 as analog input -------------------------*/
  GPIO_InitStructure.GPIO_Pin = STRING_PIN_TEMPOP5 | STRING_PIN_TEMPOP6;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIOA, &GPIO_InitStructure);
}

void SPI_Configuration(void)
{
	SPI_InitStructure.SPI_Direction = SPI_Direction_2Lines_FullDuplex;
  SPI_InitStructure.SPI_Mode = SPI_Mode_Master;
  SPI_InitStructure.SPI_DataSize = SPI_DataSize_8b;
  SPI_InitStructure.SPI_CPOL = SPI_CPOL_Low;
  SPI_InitStructure.SPI_CPHA = SPI_CPHA_2Edge;
  SPI_InitStructure.SPI_NSS = SPI_NSS_Soft;
  SPI_InitStructure.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_4;
  SPI_InitStructure.SPI_FirstBit = SPI_FirstBit_MSB;
  SPI_InitStructure.SPI_CRCPolynomial = 7;
	SPI_SSOutputCmd(SPIx, ENABLE);
  SPI_Init(SPIx, &SPI_InitStructure);
}

void ADC_Configuration(void)
{
	ADC_InitTypeDef ADC_InitStructure;
	
	ADC_DeInit(ADC1);
  ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
  ADC_InitStructure.ADC_ScanConvMode = DISABLE;
  ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
  ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_None;
  ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
  ADC_InitStructure.ADC_NbrOfChannel = 1;
  ADC_Init(ADC1, &ADC_InitStructure);
	
	ADC_Cmd(ADC1, ENABLE);
	ADC_ResetCalibration(ADC1);
	while(ADC_GetResetCalibrationStatus(ADC1));	
	ADC_StartCalibration(ADC1);
	while(ADC_GetCalibrationStatus(ADC1));
	ADC_SoftwareStartConvCmd(ADC1, ENABLE);	
}

void USART_Configuration(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
  
	USART_InitStructure.USART_BaudRate = 19200; //然而实际波特率是9600，不知道发生了啥
  USART_InitStructure.USART_WordLength = USART_WordLength_8b;
  USART_InitStructure.USART_StopBits = USART_StopBits_1;
  USART_InitStructure.USART_Parity = USART_Parity_No;
  USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
  USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

